arvind747/S32K144_FlexCAN_LoopBackTest/SOURCE/PLATFORM/drivers/src/lpspi/fsl_lpspi_master_driver.c
/*
 * Copyright (c) 2013 - 2015, Freescale Semiconductor, Inc.
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * o Redistributions of source code must retain the above copyright notice, this list
 *   of conditions and the following disclaimer.
 *
 * o Redistributions in binary form must reproduce the above copyright notice, this
 *   list of conditions and the following disclaimer in the documentation and/or
 *   other materials provided with the distribution.
 *
 * o Neither the name of Freescale Semiconductor, Inc. nor the names of its
 *   contributors may be used to endorse or promote products derived from this
 *   software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
 * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
 * ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
 * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */
#include <string.h>
#include "fsl_lpspi_master_driver.h"
#include "fsl_clock_manager.h"
#include "fsl_interrupt_manager.h"



/*******************************************************************************
 * Definitions
 ******************************************************************************/

/*******************************************************************************
 * Variables
 ******************************************************************************/
/* Pointer to runtime state structure.*/
extern void * g_lpspiStatePtr[LPSPI_INSTANCE_COUNT];

/* Table of SPI FIFO sizes per instance (this is calculated in the master init). */
extern uint32_t g_lpspiFifoSize[LPSPI_INSTANCE_COUNT];

/* Flag needed when continuous PCS mode is used and an extra TCR write is needed in the ISR to
 * de-assert PCS.
 */
uint32_t s_writeTcrInIsr = 0;

/*******************************************************************************
 * Prototypes
 ******************************************************************************/
static lpspi_status_t LPSPI_DRV_MasterStartTransfer(uint32_t instance,
                                                    const lpspi_master_config_t * spiConfig,
                                                    const uint8_t * sendBuffer,
                                                    uint8_t * receiveBuffer,
                                                    size_t transferByteCount);

static void LPSPI_DRV_MasterCompleteTransfer(uint32_t instance);

static void LPSPI_DRV_MasterFillupTxFifo(uint32_t instance);

/*******************************************************************************
 * Code
 ******************************************************************************/

/*FUNCTION**********************************************************************
 *
 * Function Name : LPSPI_DRV_MasterInit
 * Description   : Initializes a LPSPI instance for interrupt driven master mode operation.
 *
 * This function uses an interrupt-driven method for transferring data.
 * In this function, the term "spiConfig" is used to indicate the SPI device for which the LPSPI
 * master is communicating.
 * This function initializes the run-time state structure to track the ongoing
 * transfers, un-gates the clock to the LPSPI module, resets the LPSPI module,
 * configures the IRQ state structure, enables the module-level interrupt to the core, and
 * enables the LPSPI module.
 * This is an example to set up the lpspi_master_state_t and call the
 * LPSPI_DRV_MasterInit function by passing in these parameters:
 *    lpspi_master_state_t lpspiMasterState; <- the user  allocates memory for this structure
 *    lpspi_master_config_t spiConfig; Can declare more configs for use in transfer functions
 *    spiConfig.bitsPerSec = 500000;
 *    spiConfig.whichPcs = LPSPI_PCS0;
 *    spiConfig.pcsPolarity = LPSPI_ACTIVE_LOW;
 *    spiConfig.isPcsContinuous = false;
 *    spiConfig.bitCount = 16;
 *    spiConfig.clkPhase = LPSPI_CLOCK_PHASE_1ST_EDGE;
 *    spiConfig.clkPolarity = LPSPI_ACTIVE_HIGH;
 *    spiConfig.lsbFirst= false;
 *    spiConfig.rxWatermark = 2;
 *    spiConfig.txWatermark = 2;
 *    LPSPI_DRV_MasterInit(masterInstance, &lpspiMasterState, &spiConfig);
 *
 *END**************************************************************************/
lpspi_status_t LPSPI_DRV_MasterInit(uint32_t instance, lpspi_master_state_t * lpspiState,
                                    const lpspi_master_config_t * spiConfig)
{
    lpspi_status_t errorCode = LPSPI_STATUS_SUCCESS;
    LPSPI_Type *base = g_lpspiBase[instance];

     /* Check to make sure parameter pointer is not NULL or tx Buffer is NULL*/
    if ((lpspiState == NULL) || (spiConfig == NULL))
    {
        return LPSPI_STATUS_INVALID_PARAMETER;
    }

    /* Check to see if the LPSPI master instance is already initialized */
    if (g_lpspiStatePtr[instance])
    {
        return LPSPI_STATUS_INITIALIZED;
    }

    /* Save runtime structure pointers so irq handler can point to the correct state structure */
    g_lpspiStatePtr[instance] = lpspiState;

    /* Reset the LPSPI registers to their default state */
    LPSPI_HAL_Init(base);

    /* Set for master or slave mode */
    LPSPI_HAL_SetMasterSlaveMode(base, LPSPI_MASTER);

    /* Set Pin configuration such that SDO=out and SDI=in */
    LPSPI_HAL_SetPinConfigMode(base, LPSPI_SDI_IN_SDO_OUT, LPSPI_DATA_OUT_RETAINED, true);

    /* Calculate the FIFO size for the LPSPI */
    LPSPI_HAL_GetFifoSizes(base, &(g_lpspiFifoSize[instance]), NULL);

