arvind747/S32K144_FlexCAN_LoopBackTest/SOURCE/PLATFORM/drivers/src/lpspi/fsl_lpspi_master_driver.c
    /* Configure the SPI bus including the baud rate and return if there is an error */
    errorCode = LPSPI_DRV_MasterConfigureBus(instance, spiConfig, NULL);
    if (errorCode != LPSPI_STATUS_SUCCESS)
    {
        return errorCode;
    }

    /* Init the interrupt sync object.*/
    /*
    if (OSA_SemaCreate(&lpspiState->irqSync, 0) != kStatus_OSA_Success)
    {
        errorCode = LPSPI_STATUS_ERROR;
    }*/

    /* enable the interrupt */
    INT_SYS_EnableIRQ(g_lpspiIrqId[instance]);

    /* Finally, enable LPSPI */
    LPSPI_HAL_Enable(base);

    return errorCode;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : LPSPI_DRV_MasterDeinit
 * Description   : Shuts down a LPSPI instance.
 *
 * This function resets the LPSPI peripheral, gates its clock, and disables the interrupt to
 * the core.  It first checks to see if a transfer is in progress and if so returns an error
 * status.
 *
 *END**************************************************************************/
lpspi_status_t LPSPI_DRV_MasterDeinit(uint32_t instance)
{
    /* instantiate local variable of type lpspi_master_state_t and point to global state */
    lpspi_master_state_t * lpspiState = (lpspi_master_state_t *)g_lpspiStatePtr[instance];
    LPSPI_Type *base = g_lpspiBase[instance];

    /* Return error if a transfer is still in progress */
    if (lpspiState->isTransferInProgress == true)
    {
        return LPSPI_STATUS_TRANSFER_IN_PROGRESS;
    }

    /* Reset the LPSPI registers to their default state, inlcuding disabling the LPSPI */
    LPSPI_HAL_Init(base);

    /* destroy the interrupt sync object.*/
    /*OSA_SemaDestroy(&lpspiState->irqSync);*/

    /* disable the interrupt*/
    INT_SYS_DisableIRQ(g_lpspiIrqId[instance]);

    /* Gate the clock for LPSPI.*/
    /*CLOCK_SYS_DisableLpspiClock(instance);*/

    /* Clear the state pointer. */
    g_lpspiStatePtr[instance] = NULL;

    return LPSPI_STATUS_SUCCESS;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : LPSPI_DRV_MasterSetDelay
 * Description   : Configures the LPSPI master mode bus timing delay options.
 *
 * This function involves the LPSPI module's delay options to
 * "fine tune" some of the signal timings and match the timing needs of a slower peripheral device.
 * This is an optional function that can be called after the LPSPI module has been initialized for
 * master mode. The timings are adjusted in terms of cycles of the baud rate clock.
 * The bus timing delays that can be adjusted are listed below:
 *
 * SCK to PCS Delay: Adjustable delay option between the last edge of SCK to the de-assertion
 *                   of the PCS signal.
 *
 * PCS to SCK Delay: Adjustable delay option between the assertion of the PCS signal to the
 *                   first SCK edge.
 *
 * Delay between Transfers: Adjustable delay option between the de-assertion of the PCS signal for
 *                          a frame to the assertion of the PCS signal for the next frame.
 *
 *END**************************************************************************/
lpspi_status_t LPSPI_DRV_MasterSetDelay(uint32_t instance, lpspi_delay_type_t whichDelay,
                                        uint32_t delayInNanoSec, uint32_t * calculatedDelay)
{
    /* instantiate local variable of type lpspi_master_state_t and point to global state */
    lpspi_master_state_t * lpspiState = (lpspi_master_state_t *)g_lpspiStatePtr[instance];
    LPSPI_Type *base = g_lpspiBase[instance];
    lpspi_status_t errorCode = LPSPI_STATUS_SUCCESS;

    /* First, per the spec, we need to disable the LPSPI module before setting the delay */
    if (LPSPI_HAL_Disable(base) != LPSPI_STATUS_SUCCESS)
    {
        /* If error is returned, the LPSPI is busy */
        return LPSPI_STATUS_ERROR;
    }

    if (LPSPI_HAL_CalculateDelay(base, whichDelay, lpspiState->lpspiSrcClk, delayInNanoSec,
                                 calculatedDelay) != LPSPI_STATUS_SUCCESS)
    {
        /* If error is returned, the LPSPI is busy */
        return LPSPI_STATUS_ERROR;
    }

    /* Now, re-enable the LPSPI module */
    LPSPI_HAL_Enable(base);

    /* If the desired delay exceeds the capability of the device, alert the user */
    if (*calculatedDelay < delayInNanoSec)
    {
        errorCode = LPSPI_STATUS_OUT_OF_RANGE;
    }

    return errorCode;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : LPSPI_DRV_MasterConfigureBus
 * Description   : Configures the LPSPI port physical parameters to access a device on the bus when
 *                 the LSPI instance is configured for interrupt operation.
 *
 * In this function, the term "spiConfig" is used to indicate the SPI device for which the LPSPI
 * master is communicating. This is an optional function as the spiConfig parameters are
 * normally configured in the initialization function or the transfer functions, where these various
 * functions would call the configure bus function.
 * Hence the user has three options to configure the SPI device parameters: pass in the initial
 * spiConfig parameters to the init function then pass in any changes to the spiConfig to the
 * desired transfer function (see LPSPI_DRV_MasterTransferBlocking or LPSPI_DRV_MasterTransfer) or
 * pass in changes to the spiConfig to the LPSPI_DRV_MasterConfigureBus function.
 * The user can pass in a different spiConfig structure to the transfer function which contains
 * the parameters for the SPI bus to allow for communication to a different SPI device
 * (the transfer function then calls this function). However, the user also has the option to call
 * this function directly especially to get the calculated baud rate, at which point they may pass
 * in NULL for the spiConfig structure in the transfer function (assuming they have called this
 * configure bus function first). This is an example to set up the lpspi_master_config_t structure
 * to call the LPSPI_DRV_MasterConfigureBus function by passing in these parameters:
 *    lpspi_master_config_t spiConfig1;  You can also declare spiConfig2, spiConfig3, etc
 *    spiConfig1.bitsPerSec = 500000;
 *    spiConfig1.whichPcs = LPSPI_PCS0;
 *    spiConfig1.pcsPolarity = LPSPI_ACTIVE_LOW;
 *    spiConfig1.isPcsContinuous = false;
 *    spiConfig1.bitCount = 16;
 *    spiConfig1.clkPhase = LPSPI_CLOCK_PHASE_1ST_EDGE;
 *    spiConfig1.clkPolarity = LPSPI_ACTIVE_HIGH;
 *    spiConfig1.lsbFirst= false;
 *    spiConfig.rxWatermark = 2;
 *    spiConfig.txWatermark = 2;
 *
 *END**************************************************************************/
lpspi_status_t LPSPI_DRV_MasterConfigureBus(uint32_t instance,
                                            const lpspi_master_config_t * spiConfig,
                                            uint32_t * calculatedBaudRate)
{
    /* instantiate local variable of type lpspi_master_state_t and point to global state */
    lpspi_master_state_t * lpspiState = (lpspi_master_state_t *)g_lpspiStatePtr[instance];
    LPSPI_Type *base = g_lpspiBase[instance];
    uint32_t baudRate;

    /* The Transmit Command Register (TCR) Prescale value is calculated as part of the baud rate
       calculation. The value is stored in the run-time state structure for later programming
       in the TCR. */
    uint32_t tcrPrescaleValue;

    /* Check the bitcount to make sure it falls within the boundary conditions */
    if ((spiConfig->bitcount < 8) || (spiConfig->bitcount > 4096))
    {
        return LPSPI_STATUS_BITCOUNT_OUT_OF_RANGE;
    }

    /* Check the FIFO watermark settings, if watermark >= FIFO size, report out-of-range error */
    if ((spiConfig->txWatermark >= g_lpspiFifoSize[instance]) ||
        (spiConfig->rxWatermark >= g_lpspiFifoSize[instance]))
    {
        return LPSPI_STATUS_WATERMARK_OUT_OF_RANGE;
    }

    /* Configure the run-time state struct with the spiConfig parameters. Note that these
       parameters will be used later in the transfer function when programming the transmit
       command register */
    lpspiState->bitsPerFrame = spiConfig->bitcount;
    lpspiState->whichPcs = spiConfig->whichPcs;
    lpspiState->isPcsContinuous = spiConfig->isPcsContinuous;
    lpspiState->lpspiSrcClk = spiConfig->lpspiSrcClk;
    lpspiState->clkPhase = spiConfig->clkPhase;
    lpspiState->clkPolarity = spiConfig->clkPolarity;
    lpspiState->lsbFirst = spiConfig->lsbFirst;
    lpspiState->rxWatermark = spiConfig->rxWatermark;

    /* Configure the desired PCS polarity */
    LPSPI_HAL_SetPcsPolarityMode(base, spiConfig->whichPcs, spiConfig->pcsPolarity);

    /* Set the TX and RX FIFO watermarks */
    LPSPI_HAL_SetFifoWatermarks(base, spiConfig->txWatermark, spiConfig->rxWatermark);

