arvind747/S32K144_FlexCAN_LoopBackTest/SOURCE/PLATFORM/drivers/src/lpspi/fsl_lpspi_master_driver.c
    /* First, per the spec, we need to disable the LPSPI module before setting the delay */
    if (LPSPI_HAL_Disable(base) != LPSPI_STATUS_SUCCESS)
    {
        /* If error is returned, the LPSPI is busy */
        return LPSPI_STATUS_ERROR;
    }

    /* Set up the baud rate */
    baudRate = LPSPI_HAL_SetBaudRate(base, spiConfig->bitsPerSec, lpspiState->lpspiSrcClk,
                                     &tcrPrescaleValue);

    /* Now, re-enable the LPSPI module */
    LPSPI_HAL_Enable(base);

    /* If the baud rate return is "0", it means there was an error */
    if (baudRate == 0)
    {
        return LPSPI_STATUS_ERROR;
    }

    /* If the user wishes to know the calculated baud rate, then pass it back */
    if (calculatedBaudRate != NULL)
    {
        *calculatedBaudRate = baudRate;
    }

    /* Store the TCR prescale value to the run-time state struct for later programming the TCR */
    lpspiState->tcrPrescaler = tcrPrescaleValue;

    return LPSPI_STATUS_SUCCESS;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : LPSPI_DRV_MasterTransferBlocking
 * Description   : Performs an interrupt driven blocking SPI master mode transfer.
 *
 * This function simultaneously sends and receives data on the SPI bus, as SPI is naturally
 * a full-duplex bus. The function does not return until the transfer is complete.
 * This function allows the user to optionally pass in a SPI configuration structure which
 * allows the user to change the SPI bus attributes in conjunction with initiating a SPI transfer.
 * The difference between passing in the SPI configuration structure here as opposed to the
 * configure bus function is that the configure bus function returns the calculated baud rate where
 * this function does not. The user can also call the configure bus function prior to the transfer
 * in which case the user would simply pass in a NULL to the transfer function's device structure
 * parameter.
 *
 *END**************************************************************************/
lpspi_status_t LPSPI_DRV_MasterTransferBlocking(uint32_t instance,
                                                const lpspi_master_config_t * spiConfig,
                                                const uint8_t * sendBuffer,
                                                uint8_t * receiveBuffer,
                                                size_t transferByteCount,
                                                uint32_t timeout)
{
    /* instantiate local variable of type lpspi_master_state_t and point to global state */
    lpspi_master_state_t * lpspiState = (lpspi_master_state_t *)g_lpspiStatePtr[instance];
    LPSPI_Type *base = g_lpspiBase[instance];
    lpspi_status_t error = LPSPI_STATUS_SUCCESS;
    uint32_t LPSPItimeout = timeout;

    /* If the transfer count is zero, then return immediately.*/
    if (transferByteCount == 0)
    {
        return error;
    }

    /* As this is a synchronous transfer, set up the sync status variable*/
   /* osa_status_t syncStatus;*/

    /* fill in members of the run-time state struct*/
    lpspiState->isTransferBlocking = true; /* Indicates this is a blocking transfer */

    /* start the transfer process, if it returns an error code, return this back to user */
    error = LPSPI_DRV_MasterStartTransfer(instance, spiConfig, sendBuffer, receiveBuffer,
                                          transferByteCount);
    if (error != LPSPI_STATUS_SUCCESS)
    {
        /* The transfer is complete.*/
        lpspiState->isTransferInProgress = false;
        /* Disable interrupt requests*/
        /*LPSPI_CLR_IER(base, LPSPI_IER_TDIE_MASK|LPSPI_IER_RDIE_MASK);*/
        LPSPI_HAL_SetIntMode(base, LPSPI_TX_DATA_FLAG, false);
        LPSPI_HAL_SetIntMode(base, LPSPI_RX_DATA_FLAG, false);

        return error;
    }

    /* As this is a synchronous transfer, wait until the transfer is complete.*/
    do
    {
        LPSPItimeout --;
    }while(0 < LPSPItimeout && LPSPI_HAL_GetStatusFlag(base, LPSPI_MODULE_BUSY));

    /* If a timeout occurs, stop the transfer by setting the isTransferInProgress to false and
     * disabling interrupts, then return the timeout error status.
     */
    if (0 == LPSPItimeout)
    {
        /* The transfer is complete.*/
        lpspiState->isTransferInProgress = false;
        /* Disable interrupt requests*/
        /*LPSPI_CLR_IER(base, LPSPI_IER_TDIE_MASK|LPSPI_IER_RDIE_MASK);*/
        LPSPI_HAL_SetIntMode(base, LPSPI_TX_DATA_FLAG, false);
        LPSPI_HAL_SetIntMode(base, LPSPI_RX_DATA_FLAG, false);

        error = LPSPI_STATUS_TIMEOUT;
    }
    /* Transfer completed - clear blocking flag */
    lpspiState->isTransferBlocking = false;
    return error;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : LPSPI_DRV_MasterTransfer
 * Description   : Performs an interrupt driven non-blocking SPI master mode transfer.
 *
 * This function simultaneously sends and receives data on the SPI bus, as SPI is naturally
 * a full-duplex bus. The function returns immediately after initiating the transfer. The user
 * needs to check whether the transfer is complete using the LPSPI_DRV_MasterGetTransferStatus
 * function.
 * This function allows the user to optionally pass in a SPI configuration structure which
 * allows the user to change the SPI bus attributes in conjunction with initiating a SPI transfer.
 * The difference between passing in the SPI configuration structure here as opposed to the
 * configure bus function is that the configure bus function returns the calculated baud rate where
 * this function does not. The user can also call the configure bus function prior to the transfer
 * in which case the user would simply pass in a NULL to the transfer function's device structure
 * parameter.
 *
 *END**************************************************************************/
lpspi_status_t LPSPI_DRV_MasterTransfer(uint32_t instance,
                                        const lpspi_master_config_t * spiConfig,
                                        const uint8_t * sendBuffer,
                                        uint8_t * receiveBuffer,
                                        size_t transferByteCount)
{
    /* instantiate local variable of type lpspi_master_state_t and point to global state */
    lpspi_master_state_t * lpspiState = (lpspi_master_state_t *)g_lpspiStatePtr[instance];
    lpspi_status_t error = LPSPI_STATUS_SUCCESS;

