arvind747/S32K144_FlexCAN_LoopBackTest/SOURCE/PLATFORM/drivers/src/lpspi/fsl_lpspi_master_driver.c
    /* If the transfer count is zero, then return immediately.*/
    if (transferByteCount == 0)
    {
        return LPSPI_STATUS_SUCCESS;
    }

    /* fill in members of the run-time state struct*/
    lpspiState->isTransferBlocking = false; /* Indicates this is not a blocking transfer */

    /* start the transfer process, if it returns an error code, return this back to user */
    error = LPSPI_DRV_MasterStartTransfer(instance, spiConfig, sendBuffer, receiveBuffer,
                                          transferByteCount);
    if (error != LPSPI_STATUS_SUCCESS)
    {
        return error;
    }

    /* Else, return immediately as this is an async transfer */
    return LPSPI_STATUS_SUCCESS;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : LPSPI_DRV_MasterGetTransferStatus
 * Description   : Returns whether the previous interrupt driven transfer is completed.
 *
 * When performing an a-sync (non-blocking) transfer, the user can call this function to ascertain
 * the state of the current transfer: in progress (or busy) or complete (success).
 * In addition, if the transfer is still in progress, the user can get the number of words that
 * have been transferred up to now.
 *
 *END**************************************************************************/
lpspi_status_t LPSPI_DRV_MasterGetTransferStatus(uint32_t instance, uint32_t * bytesTransferred)
{
    /* instantiate local variable of type lpspi_master_state_t and point to global state */
    lpspi_master_state_t * lpspiState = (lpspi_master_state_t *)g_lpspiStatePtr[instance];

    /* Fill in the bytes transferred.*/
    if (bytesTransferred)
    {
        *bytesTransferred = lpspiState->bytesTransferred;
    }

    return (lpspiState->isTransferInProgress ? LPSPI_STATUS_BUSY : LPSPI_STATUS_SUCCESS);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : LPSPI_DRV_MasterAbortTransfer
 * Description   : Terminates an interrupt driven asynchronous transfer early.
 *
 * During an a-sync (non-blocking) transfer, the user has the option to terminate the transfer early
 * if the transfer is still in progress.
 *
 *END**************************************************************************/
lpspi_status_t LPSPI_DRV_MasterAbortTransfer(uint32_t instance)
{
    /* instantiate local variable of type lpspi_master_state_t and point to global state */
    lpspi_master_state_t * lpspiState = (lpspi_master_state_t *)g_lpspiStatePtr[instance];

    /* Check if a transfer is running.*/
    if (!lpspiState->isTransferInProgress)
    {
        return LPSPI_STATUS_NO_TRANSFER_IN_PROGRESS;
    }

    /* Stop the running transfer.*/
    LPSPI_DRV_MasterCompleteTransfer(instance);

    return LPSPI_STATUS_SUCCESS;
}

/*!
 * @brief Initiate (start) a transfer. This is not a public API as it is called from other
 *  driver functions
 */
static lpspi_status_t LPSPI_DRV_MasterStartTransfer(uint32_t instance,
                                                    const lpspi_master_config_t * spiConfig,
                                                    const uint8_t * sendBuffer,
                                                    uint8_t * receiveBuffer,
                                                    size_t transferByteCount)
{
    /* instantiate local variable of type dspi_master_state_t and point to global state */
    lpspi_master_state_t * lpspiState = (lpspi_master_state_t *)g_lpspiStatePtr[instance];
    LPSPI_Type *base = g_lpspiBase[instance];
    lpspi_status_t error;

    /* Check that we're not busy.*/
    if (LPSPI_HAL_GetStatusFlag(base, LPSPI_MODULE_BUSY))
    {
        return LPSPI_STATUS_BUSY;
    }
    /* Check if send buffer is not NULL */
    if(sendBuffer == NULL)
    {
    	return LPSPI_STATUS_INVALID_PARAMETER;
    }
    /* Configure bus for this device. If NULL is passed, we assume the caller has
     * preconfigured the bus and doesn't wish to re-configure it again for this transfer.
     * Do nothing for calculatedBaudRate. If the user wants to know the calculatedBaudRate
     * then they can call this function separately.
     */
    if (spiConfig)
    {
        error = LPSPI_DRV_MasterConfigureBus(instance, spiConfig, NULL);
        if (error != LPSPI_STATUS_SUCCESS)
        {
            return error;
        }
    }

    /* Save information about the transfer for use by the ISR.*/
    lpspiState->isTransferInProgress = true;

    LPSPI_HAL_SetFlushFifoCmd(base, true, true);

    /* No need to check for error return since we know we are not passing an invalid parameter */
    LPSPI_HAL_ClearStatusFlag(base, LPSPI_ALL_STATUS);

    /* Calculate the bytes/frame for lpspiState->bytesPerFrame */
    if (lpspiState->bitsPerFrame % 8)
    {
        lpspiState->bytesPerFrame = (lpspiState->bitsPerFrame)/8 + 1;
    }
    else
    {
        lpspiState->bytesPerFrame = (lpspiState->bitsPerFrame)/8;
    }

    /* Align the transferByteCount to the bytesPerFrame as follows:
     * If TransferByteCount is less than the bytePerFrame, then set the transferByteCount
     * to be the number of bytesPerFrame.
     * If the transferByteCount is not a multiple of the bytesPerFrame, increase the
     * transfeByteCount to the next multiple of the bytesPerFrame.
     */
    if (transferByteCount < lpspiState->bytesPerFrame)
    {
        transferByteCount = lpspiState->bytesPerFrame;
    }
    if (transferByteCount%(lpspiState->bytesPerFrame))
    {
        transferByteCount = transferByteCount + lpspiState->bytesPerFrame -
                            transferByteCount%(lpspiState->bytesPerFrame);
    }

    /* If the bytes/frame > 4, then the frame count needs to be calculated so that we can
     * transfer the data on a frame-by-frame basis. The total transfer byte count is
     * the bytes/frame multiplied by the frame count.  Therefore, the driver uses a combination
     * of the frame count and tx/rx byte counts (which are equated to the bytes/frame) to keep
     * track of the transfer.
     * If the bytes/frame is <= 4, then the frame count is zeroed out the same as the driver
     * uses the tx/rx byte counts to keep track of the transfer.
     */
    if (lpspiState->bytesPerFrame > 4)
    {
        /* The transfer count = #frames * #bytes/frame */
        lpspiState->txFrameCnt = transferByteCount/(lpspiState->bytesPerFrame);
        lpspiState->rxFrameCnt = lpspiState->txFrameCnt;
        /* Set TX and RX Count to the frame size since we're transferring on a frame basis */
        lpspiState->txCount = lpspiState->bytesPerFrame;
        lpspiState->rxCount = lpspiState->bytesPerFrame;
    }
    else
    {
        lpspiState->txFrameCnt = 0;  /* Set to 0 since this is not used for the transfer */
        lpspiState->rxFrameCnt = 0;  /* Set to 0 since this is not used for the transfer */
        /* Set TX and RX Count to the transfer byte count */
        lpspiState->txCount = transferByteCount;
        lpspiState->rxCount = transferByteCount;
    }

    /* Fill out the other members of the run-time state structure */
    lpspiState->txBuff = (const uint8_t *)sendBuffer;
    lpspiState->rxBuff = (uint8_t *)receiveBuffer;
    lpspiState->bytesTransferred = 0;

    /* Write the TCR for this transfer */
    lpspi_tx_cmd_config_t txCmdCfg = {
        .frameSize = lpspiState->bitsPerFrame,
        .width = LPSPI_SINGLE_BIT_XFER,
        .txMask = false,
        .rxMask = false,
        .contCmd = false,
        .contTransfer = lpspiState->isPcsContinuous,
        .byteSwap = false,
        .lsbFirst = lpspiState->lsbFirst,
        .whichPcs = lpspiState->whichPcs,
        .preDiv = lpspiState->tcrPrescaler,
        .clkPhase = lpspiState->clkPhase,
        .clkPolarity = lpspiState->clkPolarity
    };

