arvind747/S32K144_FlexCAN_LoopBackTest/SOURCE/PLATFORM/drivers/src/lpspi/fsl_lpspi_master_driver.c
    /* Mask the RX if no buffer is passed in */
    if (lpspiState->rxBuff == NULL)
    {
        txCmdCfg.rxMask = true;
        lpspiState->rxCount = 0; /* Since we're not receiving, set rxCount to 0 */
    }
    else
    {
    /* Enable RDF interrupt if RX buffer is not NULL */
        LPSPI_HAL_SetIntMode(base, LPSPI_RX_DATA_FLAG, true);
    }
    /* Write to the TX CMD register */
    LPSPI_HAL_SetTxCommandReg(base, &txCmdCfg);

    /* Fill up the TX FIFO */
    LPSPI_DRV_MasterFillupTxFifo(instance);

    /* Enable the TDF and RDF interrupt. */
    LPSPI_HAL_SetIntMode(base, LPSPI_TX_DATA_FLAG, true);
    return LPSPI_STATUS_SUCCESS;
}

/*!
 * @brief Fill up the TX FIFO with data.
 * This function fills up the TX FIFO with data based on the bytes/frame.
 * This is not a public API as it is called from other driver functions.
 */
static void LPSPI_DRV_MasterFillupTxFifo(uint32_t instance)
{
    /* instantiate local variable of type dspi_master_state_t and point to global state */
    lpspi_master_state_t * lpspiState = (lpspi_master_state_t *)g_lpspiStatePtr[instance];
    LPSPI_Type *base = g_lpspiBase[instance];
    uint32_t wordToSend = 0;
    uint32_t txCnt, rxCnt;

    /* Architectural note: When developing the TX FIFO fill functionality, it was found that to
     * achieve more efficient run-time performance, it was better to first check the bits/frame
     * setting and then proceed with the FIFO fill management process, rather than to clutter the
     * FIFO fill process with continual checks of the bits/frame setting.
     */

    /* Fill the TX FIFO based on the size of the frame. For frame sizes > 4, this needs to be
     * handled differently.
     */
    if (lpspiState->bytesPerFrame <= 4U)
    {
        /* Get the current remaining tx and rx byte counts */
        txCnt = lpspiState->txCount;
        /* If no RX Buffer, equate rxCnt to txCnt to keep the tx while loop going */
        if (lpspiState->rxBuff == NULL)
        {
            rxCnt = txCnt;
        }
        else
        {
            rxCnt = lpspiState->rxCount;
        }

        /* For frame size of 4 bytes */
        /* Make sure the difference in remaining TX and RX byte counts does not exceed FIFO depth
         * and that the number of TX FIFO entries does not exceed the FIFO depth
         */
        if (lpspiState->bytesPerFrame == 4)
        {
            while(((rxCnt - txCnt)/4 < g_lpspiFifoSize[instance]) &&
                  (LPSPI_HAL_ReadTxCount(base) < g_lpspiFifoSize[instance]))
            {
                if (lpspiState->txBuff)
                {
                    wordToSend = *(lpspiState->txBuff);
                    ++lpspiState->txBuff;
                    wordToSend |= (unsigned)(*(lpspiState->txBuff)) << 8U;
                    ++lpspiState->txBuff;
                    wordToSend |= (unsigned)(*(lpspiState->txBuff)) << 16U;
                    ++lpspiState->txBuff;
                    wordToSend |= (unsigned)(*(lpspiState->txBuff)) << 24U;
                    ++lpspiState->txBuff;
                }
                lpspiState->txCount -= 4; /* Decrease the remaining TX byte count by 4 */
                lpspiState->bytesTransferred += 4;

                /* Write the data word entry to TX FIFO */
                LPSPI_HAL_WriteData(base, wordToSend);

                /* If there is no more data to send then break */
                if (lpspiState->txCount == 0)
                {
                    /* If PCS is continuous, update TCR to de-assert PCS */
                    if (lpspiState->isPcsContinuous)
                    {
                        /* Only write to the TCR if the FIFO has room */
                        if (LPSPI_HAL_ReadTxCount(base) < g_lpspiFifoSize[instance])
                        {
                            LPSPI_HAL_ClearContCBit(base);
                        }
                        /* Else, set a global flag to tell the ISR to do write to the TCR */
                        else
                        {
                            s_writeTcrInIsr = 1;
                        }
                    }
                    break;
                }
                else
                {
                    /* Store the LPSPI state struct volatile member variables into temporary
                     * non-volatile variables to allow for MISRA compliant calculations
                     */
                    txCnt = lpspiState->txCount;
                    /* If no RX Buffer, re-equate rxCnt to txCnt to keep the tx while loop going */
                    if (lpspiState->rxBuff == NULL)
                    {
                        rxCnt = txCnt;
                    }
                }
            }
        }
        /* For frame size of 3 bytes */
        /* Make sure the difference in remaining TX and RX byte counts does not exceed FIFO depth
         * and that the number of TX FIFO entries does not exceed the FIFO depth
         */
        else if (lpspiState->bytesPerFrame == 3)
        {
            while(((rxCnt - txCnt)/3 < g_lpspiFifoSize[instance]) &&
                  (LPSPI_HAL_ReadTxCount(base) < g_lpspiFifoSize[instance]))
            {
                if (lpspiState->txBuff)
                {
                    wordToSend = *(lpspiState->txBuff);
                    ++lpspiState->txBuff;
                    wordToSend |= (unsigned)(*(lpspiState->txBuff)) << 8U;
                    ++lpspiState->txBuff;
                    wordToSend |= (unsigned)(*(lpspiState->txBuff)) << 16U;
                    ++lpspiState->txBuff;
                }
                lpspiState->txCount -= 3; /* Decrease the remaining TX byte count by 3 */
                lpspiState->bytesTransferred += 3;

                /* Write the data word entry to TX FIFO */
                LPSPI_HAL_WriteData(base, wordToSend);

                /* If there is no more data to send then break */
                if (lpspiState->txCount == 0)
                {
                    /* If PCS is continuous, update TCR to de-assert PCS */
                    if (lpspiState->isPcsContinuous)
                    {
                        /* Only write to the TCR if the FIFO has room */
                        if (LPSPI_HAL_ReadTxCount(base) < g_lpspiFifoSize[instance])
                        {
                            LPSPI_HAL_ClearContCBit(base);
                        }
                        /* Else, set a global flag to tell the ISR to do write to the TCR */
                        else
                        {
                            s_writeTcrInIsr = 1;
                        }
                    }
                    break;
                }
                else
                {
                    /* Store the LPSPI state struct volatile member variables into temporary
                     * non-volatile variables to allow for MISRA compliant calculations
                     */
                    txCnt = lpspiState->txCount;
                    /* If no RX Buffer, re-equate rxCnt to txCnt to keep the tx while loop going */
                    if (lpspiState->rxBuff == NULL)
                    {
                        rxCnt = txCnt;
                    }
                }
            }
        }
        /* For frame size of 2 bytes */
        /* Make sure the difference in remaining TX and RX byte counts does not exceed FIFO depth
         * and that the number of TX FIFO entries does not exceed the FIFO depth
         */
        else if (lpspiState->bytesPerFrame == 2)
        {
            while(((rxCnt - txCnt)/2 < g_lpspiFifoSize[instance]) &&
                  (LPSPI_HAL_ReadTxCount(base) < g_lpspiFifoSize[instance]))
            {
                if (lpspiState->txBuff)
                {
                    wordToSend = *(lpspiState->txBuff);
                    ++lpspiState->txBuff;
                    wordToSend |= (unsigned)(*(lpspiState->txBuff)) << 8U;
                    ++lpspiState->txBuff;
                }
                lpspiState->txCount -= 2; /* Decrease the remaining TX byte count by 2 */
                lpspiState->bytesTransferred += 2;

                /* Write the data word entry to TX FIFO */
                LPSPI_HAL_WriteData(base, wordToSend);

                /* If there is no more data to send then break */
                if (lpspiState->txCount == 0)
                {
                    /* If PCS is continuous, update TCR to de-assert PCS */
                    if (lpspiState->isPcsContinuous)
                    {
                        /* Only write to the TCR if the FIFO has room */
                        if (LPSPI_HAL_ReadTxCount(base) < g_lpspiFifoSize[instance])
                        {
                            LPSPI_HAL_ClearContCBit(base);
                        }
                        /* Else, set a global flag to tell the ISR to do write to the TCR */
                        else
                        {
                            s_writeTcrInIsr = 1;
                        }
                    }
                    break;
                }
                else
                {
                    /* Store the LPSPI state struct volatile member variables into temporary
                     * non-volatile variables to allow for MISRA compliant calculations
                     */
                    txCnt = lpspiState->txCount;
                    /* If no RX Buffer, re-equate rxCnt to txCnt to keep the tx while loop going */
                    if (lpspiState->rxBuff == NULL)
                    {
                        rxCnt = txCnt;
                    }
                }
            }
        }
        /* For frame size of 1 byte */
        /* Make sure the difference in remaining TX and RX byte counts does not exceed FIFO depth
         * and that the number of TX FIFO entries does not exceed the FIFO depth
         */
        else
        {
            while(((rxCnt - txCnt) < g_lpspiFifoSize[instance]) &&
                  (LPSPI_HAL_ReadTxCount(base) < g_lpspiFifoSize[instance]))
            {
                if (lpspiState->txBuff)
                {
                    wordToSend = *(lpspiState->txBuff);
                    ++lpspiState->txBuff;
                }
                lpspiState->txCount -= 1; /* Decrease the remaining TX byte count by 1 */
                lpspiState->bytesTransferred += 1;

                /* Write the data word entry to TX FIFO */
                LPSPI_HAL_WriteData(base, wordToSend);

                /* If there is no more data to send then break */
                if (lpspiState->txCount == 0)
                {
                    /* If PCS is continuous, update TCR to de-assert PCS */
                    if (lpspiState->isPcsContinuous)
                    {
                        /* Only write to the TCR if the FIFO has room */
                        if (LPSPI_HAL_ReadTxCount(base) < g_lpspiFifoSize[instance])
                        {
                            LPSPI_HAL_ClearContCBit(base);
                        }
                        /* Else, set a global flag to tell the ISR to do write to the TCR */
                        else
                        {
                            s_writeTcrInIsr = 1;
                        }
                    }
                    break;
                }
                else
                {
                    /* Store the LPSPI state struct volatile member variables into temporary
                     * non-volatile variables to allow for MISRA compliant calculations
                     */
                    txCnt = lpspiState->txCount;
                    /* If no RX Buffer, re-equate rxCnt to txCnt to keep the tx while loop going */
                    if (lpspiState->rxBuff == NULL)
                    {
                        rxCnt = txCnt;
                    }
                }
            }
        }
    }
    else /* FOR HANDLING FRAMES SIZES > 32 BITS */
    {
        /* Set txCnt to the FIFO size minus any data that may be in the RXFIFO and rxCnt to the
         * RXFIFO size, this way we don't overrun the RX FIFO.
         * If RxBUFF=NULL, we can leave this as is as RXCOUNT should always be 0 in this case.
         */
        txCnt = g_lpspiFifoSize[instance] - LPSPI_HAL_ReadRxCount(base);
        rxCnt = g_lpspiFifoSize[instance];

        /* Make sure the difference in remaining TX and RX word counts does not exceed FIFO depth
         * and that the number of TX FIFO entries does not exceed the FIFO depth
         */
        while(((rxCnt - txCnt) < g_lpspiFifoSize[instance]) &&
              (LPSPI_HAL_ReadTxCount(base) < g_lpspiFifoSize[instance]))
        {
            /* If there is 1 byte left in the frame */
            if (lpspiState->txCount == 1)
            {
                if (lpspiState->txBuff)
                {
                    wordToSend = *(lpspiState->txBuff);
                    ++lpspiState->txBuff;
                }
                lpspiState->txCount -= 1; /* Decrease the remaining TX byte count by 1 */
                lpspiState->bytesTransferred += 1;
            }
            /* If there are 2 bytes left in the frame */
            else if (lpspiState->txCount == 2)
            {
                if (lpspiState->txBuff)
                {
                    wordToSend = *(lpspiState->txBuff);
                    ++lpspiState->txBuff;
                    wordToSend |= (unsigned)(*(lpspiState->txBuff)) << 8U;
                    ++lpspiState->txBuff;
                }
                lpspiState->txCount -= 2; /* Decrease the remaining TX byte count by 2 */
                lpspiState->bytesTransferred += 2;
            }
            /* If there are 3 bytes left in the frame */
            else if (lpspiState->txCount == 3)
            {
                if (lpspiState->txBuff)
                {
                    wordToSend = *(lpspiState->txBuff);
                    ++lpspiState->txBuff;
                    wordToSend |= (unsigned)(*(lpspiState->txBuff)) << 8U;
                    ++lpspiState->txBuff;
                    wordToSend |= (unsigned)(*(lpspiState->txBuff)) << 16U;
                    ++lpspiState->txBuff;
                }
                lpspiState->txCount -= 3; /* Decrease the remaining TX byte count by 3 */
                lpspiState->bytesTransferred += 3;
            }
            /* If writing all four bytes to the TX FIFO */
            else
            {
                if (lpspiState->txBuff)
                {
                    wordToSend = *(lpspiState->txBuff);
                    ++lpspiState->txBuff;
                    wordToSend |= (unsigned)(*(lpspiState->txBuff)) << 8U;
                    ++lpspiState->txBuff;
                    wordToSend |= (unsigned)(*(lpspiState->txBuff)) << 16U;
                    ++lpspiState->txBuff;
                    wordToSend |= (unsigned)(*(lpspiState->txBuff)) << 24U;
                    ++lpspiState->txBuff;
                }
                lpspiState->txCount -= 4; /* Decrease the remaining TX byte count by 4 */
                lpspiState->bytesTransferred += 4;
            }

            /* Write the data word entry to TX FIFO */
            LPSPI_HAL_WriteData(base, wordToSend);

            /* If there is no more data to send, decrease frame count */
            if (lpspiState->txCount == 0)
            {
                lpspiState->txFrameCnt--;
                /* If there are still more frames to send, then reset the TX byte count */
                if (lpspiState->txFrameCnt)
                {
                    lpspiState->txCount = lpspiState->bytesPerFrame;
                }
                /* Else break if no more frames to send (note the case of continuous PCS) */
                else
                {
                    /* If PCS is continuous, update TCR to de-assert PCS */
                    if (lpspiState->isPcsContinuous)
                    {
                        /* Only write to the TCR if the FIFO has room */
                        if (LPSPI_HAL_ReadTxCount(base) < g_lpspiFifoSize[instance])
                        {
                            LPSPI_HAL_ClearContCBit(base);
                        }
                        /* Else, set global flag for ISR to write the TCR when FIFO has room */
                        else
                        {
                            s_writeTcrInIsr = 1;
                        }
                    }
                    break;
                }
            }

            /* Decrement txCnt for the while loop */
            txCnt--;

            /* If no RX Buffer, equate rxCnt to txCnt to keep the tx while loop going */
            if (lpspiState->rxBuff == NULL)
            {
                rxCnt = txCnt;
            }
        } /* while loop for filling tx fifo for frame sizes > 32-bits */
    } /* End if-else for filling tx fifo based on frame sizes < 32-bits or > 32-bits */
}

/*!
 * @brief Finish up a transfer.
 * Cleans up after a transfer is complete. Interrupts are disabled, and the LPSPI module
 * is disabled. This is not a public API as it is called from other driver functions.
 */
static void LPSPI_DRV_MasterCompleteTransfer(uint32_t instance)
{
    /* instantiate local variable of type dspi_master_state_t and point to global state */
    lpspi_master_state_t * lpspiState = (lpspi_master_state_t *)g_lpspiStatePtr[instance];
    LPSPI_Type *base = g_lpspiBase[instance];

    /* The transfer is complete.*/
    lpspiState->isTransferInProgress = false;

    /* Disable (clear) interrupt requests */
    LPSPI_HAL_SetRxDmaCmd(base, false);
    LPSPI_HAL_SetTxDmaCmd(base, false);
    LPSPI_HAL_SetIntMode(base, LPSPI_RX_DATA_FLAG, false);
    LPSPI_HAL_SetIntMode(base, LPSPI_TX_DATA_FLAG, false);
    LPSPI_HAL_SetIntMode(base, LPSPI_TRANSFER_COMPLETE, false);
    LPSPI_HAL_ClearStatusFlag(base, LPSPI_TRANSFER_COMPLETE);
    /*
    if (lpspiState->isTransferBlocking)
    {
    */
        /* Signal the synchronous completion object */
    /*
         OSA_SemaPost(&lpspiState->irqSync);
    }
    */
}

/*!
 * @brief Interrupt handler for LPSPI master mode.
 * This handler uses the buffers stored in the lpspi_master_state_t structs to transfer data.
 * This is not a public API as it is called whenever an interrupt occurs.
 */
void LPSPI_DRV_MasterIRQHandler(uint32_t instance)
{
    /* Instantiate local variable of type dspi_master_state_t and point to global state */
    lpspi_master_state_t * lpspiState = (lpspi_master_state_t *)g_lpspiStatePtr[instance];
    LPSPI_Type *base = g_lpspiBase[instance];
    uint32_t readData;  /* variable to store word read from RX FIFO */

    /* RECEIVE IRQ handler: Check read buffer only if there are remaining bytes to read. */
    if((lpspiState->rxCount) && (lpspiState->rxBuff != NULL))
    {
        /* Read the RXFIFO while there is data in the FIFO or until the RX byte count reaches 0 */
        while((LPSPI_HAL_ReadRxCount(base)) && (lpspiState->rxCount))
        {
            readData = LPSPI_HAL_ReadData(base);

