arvind747/S32K144_FlexCAN_LoopBackTest/SOURCE/PLATFORM/drivers/src/lpspi/fsl_lpspi_master_driver.c
            if (lpspiState->bytesPerFrame <= 4U)
            {
                if (lpspiState->bytesPerFrame == 4)
                {
                    *lpspiState->rxBuff = readData; /* Write first data byte to rxBuff */
                    ++lpspiState->rxBuff;     /* increment to next data byte */
                    *lpspiState->rxBuff = readData >> 8; /* Write second data byte */
                    ++lpspiState->rxBuff;    /* increment to next data byte */
                    *lpspiState->rxBuff = readData >> 16; /* Write third data byte */
                    ++lpspiState->rxBuff;    /* increment to next data byte */
                    *lpspiState->rxBuff = readData >> 24; /* Write fourth data byte */
                    ++lpspiState->rxBuff;    /* increment to next data byte */
                    lpspiState->rxCount -= 4;
                }
                else if (lpspiState->bytesPerFrame == 3)
                {
                    *lpspiState->rxBuff = readData; /* Write first data byte to rxBuff */
                    ++lpspiState->rxBuff;     /* increment to next data byte */
                    *lpspiState->rxBuff = readData >> 8; /* Write second data byte */
                    ++lpspiState->rxBuff;    /* increment to next data byte */
                    *lpspiState->rxBuff = readData >> 16; /* Write third data byte */
                    ++lpspiState->rxBuff;    /* increment to next data byte */
                    lpspiState->rxCount -= 3;
                }
                else if (lpspiState->bytesPerFrame == 2)
                {
                    *lpspiState->rxBuff = readData; /* Write first data byte to rxBuff */
                    ++lpspiState->rxBuff;     /* increment to next data byte */
                    *lpspiState->rxBuff = readData >> 8; /* Write second data byte */
                    ++lpspiState->rxBuff;    /* increment to next data byte */
                    lpspiState->rxCount -= 2;
                }
                else
                {
                    *lpspiState->rxBuff = readData; /* Write first data byte to rxBuff */
                    ++lpspiState->rxBuff;     /* increment to next data byte */
                    lpspiState->rxCount -= 1;
                }
            }
            else /* FOR HANDLING FRAMES SIZES > 32 BITS */
            {
                /* If there is 1 byte left in the frame */
                if (lpspiState->rxCount == 1)
                {
                    *lpspiState->rxBuff = readData;
                    ++lpspiState->rxBuff;
                    lpspiState->rxCount -= 1;
                }
                /* If there are 2 bytes left in the frame */
                else if (lpspiState->rxCount == 2)
                {
                    *lpspiState->rxBuff = readData;
                    ++lpspiState->rxBuff;
                    *lpspiState->rxBuff = readData >> 8;
                    ++lpspiState->rxBuff;
                    lpspiState->rxCount -= 2;
                }
                /* If there are 3 bytes left in the frame */
                else if (lpspiState->rxCount == 3)
                {
                    *lpspiState->rxBuff = readData;
                    ++lpspiState->rxBuff;
                    *lpspiState->rxBuff = readData >> 8;
                    ++lpspiState->rxBuff;
                    *lpspiState->rxBuff = readData >> 16;
                    ++lpspiState->rxBuff;
                    lpspiState->rxCount -= 3;
                }
                /* If reading all four bytes from the RX FIFO */
                else
                {
                    *lpspiState->rxBuff = readData;
                    ++lpspiState->rxBuff;
                    *lpspiState->rxBuff = readData >> 8;
                    ++lpspiState->rxBuff;
                    *lpspiState->rxBuff = readData >> 16;
                    ++lpspiState->rxBuff;
                    *lpspiState->rxBuff = readData >> 24;
                    ++lpspiState->rxBuff;
                    lpspiState->rxCount -= 4;
                }

                /* If rxCount is 0, then check to see if there are more bytes to transfer by
                 * checking the rxFrameCnt. If there are more bytes to transfer, reset the rxCount
                 * to the original bytes/frame else leave it as 0 where we'll break out of while
                 * loop.
                 */
                if (lpspiState->rxCount == 0)
                {
                    lpspiState->rxFrameCnt--;
                    if (lpspiState->rxFrameCnt)
                    {
                        lpspiState->rxCount = lpspiState->bytesPerFrame;
                    }
                }
            }
        }
    }  /* End of RECEIVE IRQ handler */

    /* TRANSMIT IRQ handler: if there is more data to send, then fill the TX FIFO. Else, check to
     * see if this is a continuous PCS transfer, and if so see if conditions are met to de-assert
     * PCS here in the ISR.
     */
    if (lpspiState->txCount)
    {
        LPSPI_DRV_MasterFillupTxFifo(instance);
    }
    else
    {
        /* Disable TX flag. Software buffer is empty.*/
        LPSPI_HAL_SetIntMode(base, LPSPI_TX_DATA_FLAG, false);
        LPSPI_HAL_SetIntMode(base, LPSPI_TRANSFER_COMPLETE, true);
        /* If PCS is continuous, update TCR to de-assert PCS */
        if ((lpspiState->isPcsContinuous) && (s_writeTcrInIsr))
        {
            /* Only write the TCR if there is room in the TX FIFO */
            if (LPSPI_HAL_ReadTxCount(base) < g_lpspiFifoSize[instance])
            {
                LPSPI_HAL_ClearContCBit(base);
                s_writeTcrInIsr = 0; /* Clear this so that we don't keep doing this needlessly */
            }
        }
        /* Check if we're done with this transfer.*/
        if ((lpspiState->txCount == 0) && (lpspiState->rxCount == 0) && LPSPI_HAL_GetStatusFlag(base, LPSPI_TRANSFER_COMPLETE))
        {
            LPSPI_DRV_MasterCompleteTransfer(instance);
        }
    }
}


/*******************************************************************************
 * EOF
 ******************************************************************************/

